// © Copyright 2004-2013, 2015-2016 HP Development Company, L.P.

UtilityWindowPreferredSize = "{796, 406}";

kCheckChangesAlertTitleKey = "Olet muuttanut tietoja. Haluatko jatkaa?";
kCheckChangesAlertContinueButtonTitleKey = "Jatka";
kCheckChangesAlertMessageKey = "Jos jatkat, kaikki muutokset poistetaan. Voit hylätä toimet ja jatkaa käsittelyä napsauttamalla Peruuta-painiketta.";

DeviceStatusUnknown = "Tuntematon";

NoItemsMenuTitle = "Ei kohteita";

NotEnoughSpaceTitle = "HP Utility käynnistys ei onnistunut";
NotEnoughSpaceMsg = "Käynnistyslevysi on lähes täynnä. Sinun täytyy vapauttaa levytilaa käynnistyslevyltä poistamalla tiedostoja.";

RecentUnreachableTitle = "Yhteyttä ei voitu muodostaa.";
RecentUnreachableMsg = "%@ ei ole käytettävissä. Tarkista, onko laite kytketty päälle ja liitetty, tai yritä myöhemmin uudelleen.";

AirPortDeviceErrorTitle = "HP Utility ei toimi yhdessä AirPortiin liitettyjen laitteiden kanssa.";
SharedDeviceErrorTitle = "HP Utility ei voi käyttää yhdessä jaettujen laitteiden kanssa.";
NotDirectDeviceErrorDescription = "Voit käyttää laitetta yhdistämällä sen suoraan Mac-tietokoneeseen.";

NoUtilityMessage = "Asenna laitteesi mukana toimitettu ohjelmisto uudelleen.";

// menu items
ShowAdvanced = "Näytä lisäasetukset";
HideAdvanced = "Piilota lisäasetukset";

DeviceOKButtonTitle = "OK";
DeviceResumeButtonTitle = "Jatka";
SupplyInfoTaskTitle = "Tarviketiedot";
TravelInfoTaskTitle = "Ohjeita matkaajille";

kTaskGroupUnknownTitleKey = "Muu";
kTaskGroupInformationAndSupportTitleKey = "Tiedot ja tuki";
kTaskGroupInformationAndPrintQualityTitleKey = "Tietoja ja tulostuslaatu";
kTaskGroupPrinterSettingsTitleKey = "Tulostimen asetukset";
kTaskGroupFaxSettingsTitleKey = "Faksiasetukset";
kTaskGroupNetworkSettingsTitleKey = "Verkkoasetukset";
kTaskGroupInformationTitleKey = "Tietoja";
kTaskGroupColorCenterTitleKey = "HP Color Center";
kTaskGroupConfigurationTitleKey = "Määritys";
kTaskGroupSupportTitleKey = "Tuki";
kTaskGroupJobCenterTitleKey = "Työkeskus";
kHSDTaskGroupScanSettingsTitleKey = "Skannausasetukset";

ApplyButtonTitle = "Ota käyttöön";

kViewMenuTitle = "Näytä";

AskSaveChangesAlertTitle = "Olet muuttanut näytön asetuksia";
AskSaveChangesAlertMsg = "Haluatko ottaa muutokset käyttöön ennen sen sulkemista?";
AskSaveChangesDontApplyButtonTitle = "Älä käytä";
AskSaveCahngesApplyButtonTitle = "Käytä";

MultipleAskSaveChangesAlertTitle = "Olet muuttanut asetuksia %i ikkunassa";
MultipleAskSaveChangesAlertMsg = "Haluatko tarkastella muutoksia ennen lopettamista?";
MultipleAskSaveChangesDiscardButtonTitle = "Hylkää muutokset";
MultipleAskSaveChangesReviewButtonTitle = "Tarkastele muutoksia...";

ConnectingMessage = "Muodostetaan yhteyttä laitteeseen\n%@";

DefaultWindowTitleString = "HP Utility";
DeviceNotSelectedMessageString = "Aloita valitsemalla laite";

DevicesItemTitleString = "Laitteet";
DevicesItemTooltipString = "Näytä/piilota laitteet";
SupportItemTitleString = "HP-tuki";
SupportItemTooltipString = "HP:n online-tuki";
SuppliesItemTitleString = "Tarvikkeet";
SuppliesItemTooltipString = "Osta tarvikkeita verkossa";
RegistrationItemTitleString = "Rekisteröinti";
RegistrationItemTooltipString = "Online-rekisteröinti";
RecyclingItemTitleString = "Kierrätys";
RecyclingItemTooltipString = "Palauttaminen ja kierrätys";
MarsItemTitleString = "Tuoteparannus";
MarsItemTooltipString = "HP-tuotekehitystutkimus";
TasksItemTitleString = "Kaikki asetukset";
TasksItemTooltipString = "Näytä kaikki asetukset";
SearchItemTitleString = "Etsi";
SearchItemTooltipString = "Etsi laajennusta tai avainsanaa";

HSDAddDevicesToolTip = "Lisää laitteita";
HSDRemoveDevicesToolTip = "Poista valittu laite tai älyryhmä";
HSDPullDownMenuToolTip = "Toimintovalikko";
TaskCellWidth = "98";

PrintersGroupString = "LAITTEET";
SmartGroupsString = "ÄLYKKÄÄT RYHMÄT";

PrinterName = "Laitteen nimi";
ModelName = "Malli";
SerialNumber = "Sarjanumero";
IPAddress = "IP-osoite";
BluetoothAddress = "Osoite";
ConnectionType = "Yhteys";

kSmartGroupDefaultName = "Älykäs ryhmä";
kSmartGroupRulePropertyModel = "Malli";
kSmartGroupRulePropertyName = "Nimi";
kSmartGroupRulePropertyURI = "URI";
kSmartGroupRulePropertyIPAddress = "IP-osoite";
kSmartGroupRulePropertyConnectionType = "Yhteystyyppi";

kSmartGroupRuleCriterionContains = "Sisältää";
kSmartGroupRuleCriterionDoesntContain = "Ei sisällä";
kSmartGroupRuleCriterionIs = "On";
kSmartGroupRuleCriterionIsNot = "Ei ole";
kSmartGroupRuleCriterionStartsWith = "Alkaa merkillä";
kSmartGroupRuleCriterionEndsWith = "Päättyy merkkiin";

kSmartGroupRuleValueTypeUSB = "USB";
kSmartGroupRuleValueTypeIP = "IP";
kSmartGroupRuleValueTypeBonjour = "Bonjour";
kSmartGroupRuleValueTypeBluetooth = "Bluetooth";

HSDRulesMatchStyleAll = "kaikki";
HSDRulesMatchStyleAny = "mikä tahansa";

IncompatibleTasksTitle = "Osat ovat yhteensopimattomia";
IncompatibleTasksMessage = "Jotkin tietokoneeseen asennetut osat on tarkoitettu käytettäviksi HP Utility eri version kanssa. Näitä osia ei ladata, eivätkä kaikki laitteeseen liittyvät toiminnot ole käytettävissä. Avaa HP:n verkkotukisivusto napsauttamalla HP:n tukikuvaketta työkalurivillä ja lataa uusin versio HP:n ohjelmistosta.";

NoComponentsTitle = "Eräitä HP Utility osia ei löytynyt";

ShowDevicesItemTitle = "Näytä laitteet";
HideDevicesItemTitle = "Piilota laitteet";
ShowToolbarItemTitle = "Näytä työkalurivi";
HideToolbarItemTitle = "Piilota työkalurivi";

DevicesMenuSetupDeviceItemTitle = "Asenna uusi laite…";
DevicesMenuSetupSelectedDeviceItemTitle = "Asennetaan valittu laite…";
DevicesMenuSetupWirelessItemTitle = "HP:n automaattinen langaton yhteys…";
DevicesMenuAddDevicesItemTitle = "Lisää laitteita…";
DevicesMenuAddDeviceManuallyItemTitle = "Lisää laite manuaalisesti…";
DevicesMenuNewSmartGroupItemTitle = "Uusi älykäs ryhmä…";
DevicesMenuEditSmartGroupItemTitle = "Muokkaa älykästä ryhmää…";
DevicesMenuPrintersMenuTitle = "Laiteluettelo";
DevicesMenuEmptyItemTitle = "(Tyhjä)";

DevicesMenuRemoveDeviceItemTitle = "Poista laite";
DevicesMenuRemoveSmartGroupItemTitle = "Poista älykästä ryhmää";
DevicesMenuSortByItemTitle = "Lajitteluperuste";
DevicesMenuNameItemTitle = "Nimi";
DevicesMenuAvailabilityItemTitle = "Saatavuus";

HSDAddDeviceManuallyItemTitle = "Lisää laite manuaalisesti…";
HSDNewSmartGroupItemTitle = "Uusi älykäs ryhmä…";
HSDEditSmartGroupItemTitle = "Muokkaa älykästä ryhmää…";

DeviceNotAvailableMessageString = "Valittu laite ei ole tällä hetkellä käytettävissä. Valitse toinen laite.";
ScanjetDeviceNotAvailableMessageString = "Valittu laite ei ole tällä hetkellä käytettävissä. Varmista, että laite on päällä ja liitetty tietokoneeseen ja että tarvittava ohjelmisto on asennettu.";

AppManagerItemTitleString = "Ohjelmat";
AppManagerItemTooltipString = "Ohjelmat";

AppManagerAskApplyChangesAlertTitle = "Haluatko ottaa tekemäsi muutokset käyttöön?";
AppManagerAskApplyChangesAlertMsg = "Muutokset menetetään, jos et ota niitä käyttöön.";
AppManagerApplyButtonTitle = "Ota käyttöön";
CancelButtonTitleKey = "Peruuta";
AppManagerDontApplyButtonTitle = "Älä ota käyttöön";

NoSaveTitle = "Tiedoston tallennus ei onnistunut";
DidNotSaveMessage = "Varmista levytilan riittävyys ja se, että käyttöoikeutesi riittävät tiedoston tallentamiseen määritettyyn sijaintiin.";

ConnectMenuItemTitleFormat = "Yhdistä kohteeseen %@";
EditMenuItemTitleFormat = "Muokkaa %@...";
RemoveMenuItemTitleFormat = "Poista %@";

ShowOnlineAccessWarningsCommandTitle = "Näytä verkkokäyttövaroitukset";
HideOnlineAccessWarningsCommandTitle = "Piilota verkkokäyttövaroitukset";

HSDSmartGroupNameTitle = "Älykkään ryhmän nimi:";
HSDMatchTextFieldTitle1 = "Vastaavuus";
HSDMatchTextFieldTitle2 = "seuraavista säännöistä:";
HSDCancelButtonTitle = "Peruuta";
HSDOKButtonTitle = "OK";

// locked feature view
HSDDisabledFeatureTitle = "Laitteen järjestelmänvalvoja on lukinnut tai poistanut käytöstä tämän toiminnon";
HSDDisabledFeatureDescription = "Toiminto voidaan ottaa käyttöön Laitteen hallinta -ruudusta. Avaa ruutu valitsemalla \"Siirry\".";
HSDNoWayToUnlockDescription = "Et voi käyttää toimintoa, sillä se on lukittu tai poistettu käytöstä. Pyydä lisätietoja henkilöltä, joka määritti tulostimen asetukset.";
HSDGoButton = "Siirry";

// Alert for Ink Subscription
SubscribedSuppliesTitle = "Laitteessa on aktiivinen mustetilaus";
SubscribedSuppliesMessage = "Muista… Voit hankkia tämän tulostimen vaihtokasetit alennettuun hintaan HP:n pikamustepalvelun välityksellä! Voit edelleen käydä myös HP:n verkkokaupassa ja hankkia lisävarusteita ja tarvikkeita muihin laitteisiin.";
GoToStoreButtonTitle = "Siirry kauppaan";

//Search Window
SearchWindowTitle = "Etsi";
SearchWindowTaskTitle = "Etsi:";
SearchWindowButtonCancelTitle = "Peruuta";
SearchWindowButtonSearchTitle = "Etsi";

//Main Menu
"HP Utility" = "HP Utility";
"About HP Utility" = "Tietoja HP Utility";
"Hide HP Utility" = "Piilota HP Utility";
"Hide Others" = "Piilota muut";
"Show All" = "Näytä kaikki";
"Quit HP Utility" = "Poistu HP Utility";

"Devices" = "Laitteet";

"Edit" = "Muokkaa";
"Undo" = "Peru";
"Redo" = "Tee sittenkin";
"Cut" = "Leikkaa";
"Copy" = "Kopioi";
"Paste" = "Liitä";
"Delete" = "Poista";
"Select All" = "Valitse kaikki";

"View" = "Näytä";

"Window" = "Ikkuna";
"Close" = "Sulje";
"Minimize" = "Pienennä";
"Zoom" = "Suurenna/pienennä";
"Bring All to Front" = "Tuo kaikki etualalle";

Version = "Versio";

// Global Mode
MarsUnavailableAlertTitle = "HP:n tuotekehitystutkimuksen määrittäminen ei onnistu";
MarsUnavailableAlertDescription = "Laitteesi eivät kelpaa HP:n tuotekehityksen tutkimusohjelmaan.";
MarsUnavailableForOnlineDevicesAlertDescription = "Verkkolaitteesi eivät kelpaa HP:n tuotekehityksen tutkimusohjelmaan. Kytke virta muihin laitteisiisi, yhdistä ne Mac-tietokoneeseen tai verkkoon ja yritä sitten uudelleen.";
